# 1) რა არის პითონი პროგრამირებაში?
# პასუხი: პროგრამული ენა
# 2) რა არის turtle-ი python-ში?
# პასუხი: library
# 3) რას გამოიტანს ეს კოდი ტერმინალში?
# print('heloo world')
# პასუხი: heloo world
# 4) რას გამოიტანს ეს კოდი ტერმინალში?
print(True > False)
# პასუხი: true რადგან true = 1 და false = 0
# 5) რითი ვქმნით კომენტარებს python-ში?
# პასუხი: #
# 6) რას გამოიტანს ეს კოდი ტერმინალში?
x = 15
y = 4
print(x // y)
# პასუხი: 3 რადგან 2 დახრილი ხაზი გვიჩვენებს იმას თუ რამდენჯერ მოთავსდება ერთი რივ=ცხვი მეორეში
# 7) რას გამოიტანს ეს კოდი ტერმინალში? 
x = 10
y = 4
print(x / y)
# პასუხი: 2,5 რადგან ერთი დახრილი ხაზი გვიჩვენებს გაყოფას
# 8) რას გამოიტანს ეს კოდი ტერმინალში?
x = 10
y = "20"
print(x + y)
# პასუხი: error რადგან string და integer ერთმანეთს ვერ დაემატება
# 9) რას გამოიტანს ეს კოდი ტერმინალში?
x = 5
y = 2
print(x ** y)
# პასუხი: 25 რადგან ** გვიჩვენებს რიცხვი რამდენის ხარისხშია
# 10) if მუშაობს else-ის გარეშე
# პასუხი: true
# 11) რითი მთავრდება for loop?
# პასუხი: break
# 12) რა იქნება თუ 10 % 3?
# პასუხი: 1 რადგან % გვიჩვენებს თუ რამდენი დარჩება ნაშთი
# 13) integer მრავლდება string-ზე
# პასუხი: true
# 14) რას გამოიტანს ეს კოდი ტერმინალში?
print(3>4 or 3<5 and 500 < 400 or 320 > 244)
# პასუხი: true 
# 15) რა არის სია list?
# პასუხი: array
# რა არის ალგორითმი?
# პასუხი: მოქმედების, ნაბიჯ-ნაბიჯ შესრულება <3
# 16) პითონი გველია თუ კუდი?
# პასუხი: კუდი მაგრამ მეც არ ვიცი რატომ :)
# 17) დავითი უსმენს როკის სტილის მუსიკას
# პასუხი: true
# 18) ბატონი გაბრიელი არ უსმენს მამაპაპურ ქართულ მუსიკებს
# პასუხი: false
# 19) გაკვეტილი ჩატარდა კანფეტივით
# პასუხი: true as always
# 20) რომელი ხინკალი ჯობია
# პასუხი: ფასანაურული the best